#220131 / 동적계획법 1 / 10844 / 쉬운계단수
"""
10 12 21 23 32 34 
1 2 3 4 5 6 7 8 9
10 12
21 23
87 89
98
101 121 123
210 212 232 234
321 323 343 345
876 878 898
987 989 
1010 1012 10123 1210 1212 1232 1234
2101 2121 2123 2321 2323 2343 2345 

n 자리일떄
n == 1시작 일때
1 = [-2][n] + [-1][n+1]
1<n<9
2 = [-1][n-1] + [-1]n+1
n==9
0 = [-1][n-1]
"""
n = int(input())

arr = [[1,1,1,1,1,1,1,1,1],[2,2,2,2,2,2,2,2,1]]

if n > 2:
    for i in range(2, n):
        arrn = []
        for j in range(9):
            if j == 0:
                arrn.append(arr[i-2][j]+arr[i-1][j+1])
            elif j == 8:
                arrn.append(arr[i-1][j-1])
            else:
                arrn.append(arr[i-1][j-1]+arr[i-1][j+1])
        arr.append(arrn)

print(sum(arr[n-1])%1000000000)